{
  "version": 1,
  "notes": "Expanded mock conversations with deeper context, multi-turn dialogue, and progressive JSON profile updates. Ukrainian-first.",
  "conversations": [
    {
      "key": "career_path_extended_1",
      "title": "Вибір шляху: від оператора БПЛА до IT",
      "conv_type": "CAREER_PATH",
      "messages": [
        {
          "is_user": true,
          "content": "Вітаю. Повернувся зі служби, шукаю себе. Був оператором БПЛА, добре розбираюся в техніці, паяв дрони, прошивав. Але не хочу більше 'польової' роботи. Думаю про IT, але не знаю, чи потягну."
        },
        {
          "is_user": false,
          "content": "Вітаю! Дякую за службу. Ваш досвід з БПЛА — це вже чудова технічна база (hardware + software). Щоб зрозуміти, куди саме в IT вам буде найлегше зайти, уточніть:\n1) Що вам подобалося більше: копатися в «залізі» (пайка, збірка) чи налаштування софту/прошивок?\n2) Який у вас рівень англійської?\n3) Чи готові ви витратити 3–6 місяців на навчання без доходу, чи робота потрібна «на вчора»?"
        },
        {
          "is_user": true,
          "content": "Більше подобався софт і тестування, коли перевіряли пташок перед вильотом. Англійська десь на рівні читання документації зі словником (A2-B1). Робота потрібна десь за 2–3 місяці, маю невелику подушку."
        },
        {
          "is_user": false,
          "content": "Виходячи з цього, для вас є два дуже логічні шляхи входу в IT:\n\n1. **QA Engineer (Manual)** — тестувальник. Це про уважність, чек-листи та перевірку, чи працює продукт як треба. Дуже схоже на передпольотну перевірку, тільки для сайтів/додатків.\n2. **Hardware/Embedded Tester** — тестування «заліза» та прошивок. Тут ваш досвід з дронами буде прямим плюсом, конкуренція менша, ніж у вебі.\n\nВраховуючи англійську A2-B1, другий варіант може бути швидшим для старту в українських MilTech або IoT компаніях. Що скажете?"
        },
        {
          "is_user": true,
          "content": "Hardware Tester звучить цікаво, бо я розумію фізику процесів. Але чи є такі вакансії зараз у цивільному секторі, не пов'язаному з війною? Хочу трохи відпочити від військової тематики."
        },
        {
          "is_user": false,
          "content": "Зрозумів, це важливий момент. Так, такі вакансії є. Основні сфери:\n- **IoT (Розумний дім):** Ajax (хоча вони дотичні до безпеки, це цивільний продукт), розробники розумних лічильників, датчиків.\n- **Automotive:** компанії, що пишуть софт для авто (навігація, бортові комп'ютери).\n- **Агротех:** електроніка для аграрних дронів чи техніки (це не про війну, а про врожай).\n\nПлан дій пропоную такий:\n1. Підтягнути теорію тестування (ISTQB база).\n2. Оформити досвід з БПЛА як «Testing & Troubleshooting» у резюме.\n3. Шукати компанії, що займаються електронікою.\n\nПочати з підготовки резюме чи списку тем для навчання?"
        },
        {
          "is_user": true,
          "content": "Давайте почнемо з навчання. Що мені почитати чи подивитися за цей тиждень?"
        },
        {
          "is_user": false,
          "content": "Ось план на перший тиждень (Embedded/Hardware Testing):\n\n1.  **Основи QA:** Почитайте про життєвий цикл бага (Bug Life Cycle) та як писати баг-репорти (Jira/Trello). Книга: *Svyatoslav Kulikov \"Testing Primer\"* (є українською).\n2.  **Linux/Console:** Згадайте базові команди терміналу, це мастхев для роботи з платами.\n3.  **Мережі:** Як передаються дані (протоколи HTTP, MQTT — важливо для IoT).\n\nЯ можу також підібрати перелік безкоштовних курсів, якщо готові приділяти цьому 2–3 години на день."
        }
      ]
    },
    {
      "key": "hiring_extended_logistics",
      "title": "Наймана праця: Керівник складу",
      "conv_type": "HIRING",
      "messages": [
        {
          "is_user": true,
          "content": "Привіт. Я звільнився, був заступником комбата з тилу (логістика). Хочу знайти роботу керівником складу або директором з логістики. Але боюся, що мене сприймуть як просто «вояку», який тільки накази вміє віддавати."
        },
        {
          "is_user": false,
          "content": "Вітаю! Це поширений стереотип, але ми його зламаємо мовою бізнесу. Ваш досвід — це Supply Chain Management в екстремальних умовах. \n\nЩоб «перекласти» ваш досвід, назвіть, будь ласка:\n1) Якими обсягами ви керували (кількість людей, машин, тоннаж вантажів на місяць)?\n2) Чи використовували ви якесь ПЗ для обліку (Excel, SAP, спеціальні армійські програми)?"
        },
        {
          "is_user": true,
          "content": "В підпорядкуванні було 45 людей, автопарк 15 вантажівок. Забезпечували батальйон (понад 500 осіб) всім: від їжі до ПММ і БК. Оборот — десятки тонн на тиждень. Облік вели в Excel + паперові журнали, на жаль."
        },
        {
          "is_user": false,
          "content": "Чудово. У вас рівень **Warehouse Manager** або **Head of Logistics** для середнього бізнесу. \n\nЯк ми це подамо в резюме:\n- Не «забезпечував батальйон», а **«Організував безперебійний ланцюг постачання для 500+ споживачів в умовах кризи»**.\n- Не «командував взводом», а **«Управління крос-функціональною командою з 45 осіб (водії, комірники, механіки)»**.\n- Про Excel скажемо: **«Ведення складського обліку та звітності в Excel, оптимізація залишків»**.\n\nНа яку зарплату ви орієнтуєтесь і в якому місті шукаєте?"
        },
        {
          "is_user": true,
          "content": "Київ або область. Хотів би від 40-50 тисяч грн. Це реально?"
        },
        {
          "is_user": false,
          "content": "Для Києва на позицію керівника складу (Warehouse Manager) із вашим масштабом відповідальності — це абсолютно реальна, навіть трохи занижена цифра. Ринок зараз пропонує 45–70 тис. грн залежно від компанії.\n\nСтратегія пошуку:\n1. **Резюме:** Робимо акцент на *надійності*, *матеріальній відповідальності* та *дисципліні* (роботодавці це цінують у логістиці).\n2. **Співбесіда:** Вас будуть питати про «гнучкість». Важливо показати, що ви вмієте не тільки наказувати, а й домовлятися з постачальниками.\n\nДавайте складемо розділ «Про себе» (Summary) для резюме? Напишіть, яка ваша найсильніша риса характеру в роботі."
        },
        {
          "is_user": true,
          "content": "Найсильніша риса — вміння вирішувати проблеми, коли все йде не за планом. Коли машина зламалася, а вантаж треба доставити через 2 години."
        },
        {
          "is_user": false,
          "content": "Це називається **Crisis Management** та **Problem Solving**. \n\nОсь варіант Summary для вашого резюме:\n> «Менеджер з логістики з досвідом управління командами (45+ осіб) та складними ланцюгами постачання. Експерт у кризовому менеджменті: вмію швидко знаходити рішення та забезпечувати результат у нестабільних умовах. Шукаю роль керівника складу/логістики для побудови прозорих та ефективних процесів».\n\nЯк вам такий варіант? Чи додамо щось про автотранспорт?"
        }
      ]
    },
    {
      "key": "business_extended_coffeeshop",
      "title": "Бізнес: Валідація ідеї кав'ярні",
      "conv_type": "BUSINESS",
      "messages": [
        {
          "is_user": true,
          "content": "Привіт. Є ідея відкрити кав'ярню в своєму районі (Київ, спальний масив). Бачу, що люди постійно п'ють каву, виглядає як легкий бізнес."
        },
        {
          "is_user": false,
          "content": "Вітаю! Кав'ярня — це класика, але «легкість» тут оманлива. Конкуренція в Києві шалена. Щоб я міг дати чесну оцінку, мені потрібна конкретика:\n1. **Бюджет:** Скільки грошей готові вкласти на старті (ремонт, обладнання, оренда, перша закупівля)?\n2. **Локація:** Це МАФ, перший поверх будинку чи острівець у ТЦ? Чи є вже конкретне приміщення?\n3. **Досвід:** Чи працювали ви баристою або керували закладом раніше?"
        },
        {
          "is_user": true,
          "content": "Бюджет десь 6000$. Приміщення ще шукаю, думаю про перший поверх у новобудові. Досвіду в каві немає, але готовий найняти баристу, а сам займатися управлінням."
        },
        {
          "is_user": false,
          "content": "Буду відвертим (business check): **$6000 для стаціонарної кав'ярні в новобудові Києва — це критично мало.**\n\nЧому:\n- Професійна кавомашина + кавомолка (навіть б/в) = $1500–2500.\n- Оренда (перший + останній місяць + комісія) = $1000–1500.\n- Ремонт, меблі, вивіска = від $3000.\n- Товар, посуд, дрібниці = $1000.\nВи вже в мінусі, а ще треба подушку на зарплату персоналу на перші місяці.\n\n**Ризики:** Висока ймовірність закритися через 3 місяці через брак обігових коштів.\n\nАльтернативні варіанти під ваш бюджет:\n1. **Мобільна кав'ярня (кавомобіль).**\n2. **Купівля готового бізнесу (острівець)**, який терміново продають (іноді можна знайти за $5-7к).\n3. **Take-away вікно (МАФ)** з мінімальним ремонтом.\n\nЩо думаєте про ці варіанти?"
        },
        {
          "is_user": true,
          "content": "Зрозумів, дякую за чесність. А якщо МАФ (вікно)? Які там підводні камені з документами?"
        },
        {
          "is_user": false,
          "content": "МАФ (Тимчасова споруда) — це реалістичніше по грошах, але складніше юридично.\n\n**Головні «підводні камені»:**\n1. **Паспорт прив'язки:** У Києві дуже важко легально встановити *новий* МАФ. Найчастіше орендують вже існуючий з документами. Перевіряйте документи в КМДА (Департамент містобудування), щоб його не знесли через тиждень.\n2. **Електроенергія:** Підключення потужності (кавомашина бере 3–5 кВт) — це часто проблема в МАФах. Треба перевірити договір з ДТЕК.\n3. **СЕС (Держпродспоживслужба):** Навіть у кіоску має бути вода (рукомийник) і санітарна книжка у баристи.\n\nЯкщо знайдете легальний МАФ в оренду, бюджет $6000 може спрацювати: $2000 оренда/депозити, $2000 обладнання, $2000 запуск.\n\nХочете, розпишемо чек-лист, як перевірити місце перед орендою?"
        },
        {
          "is_user": true,
          "content": "Так, давайте чек-лист. І як порахувати, скільки чашок треба продавати, щоб вийти в нуль?"
        },
        {
          "is_user": false,
          "content": "Чек-лист перевірки місця:\n1. **Трафік:** Постійте там у вівторок вранці (8:00–10:00) і порахуйте людей, що йдуть повз. Нормальна конверсія — 1–3%. Якщо проходить 100 людей/год — це 1–3 клієнти. Цього мало.\n2. **Конкуренти:** Хто є в радіусі 300 метрів? Чим ви кращі? (Ціна? Смак? Швидкість?)\n\n**Розрахунок точки беззбитковості (приклад):**\n- Середній чек: 60 грн.\n- Собівартість (кава, молоко, стакан): ~18–20 грн (маржа ~40 грн).\n- Постійні витрати (оренда, світло, зарплата баристи): припустімо 40,000 грн/місяць.\n\nФормула: `Витрати / Маржа = Кількість чашок`\n40,000 / 40 = **1000 чашок на місяць**.\nЦе **33 чашки в день** — тільки щоб не піти в мінус (вийти в нуль).\nЩоб заробляти собі $1000 — треба продавати десь 70–80 чашок в день.\n\nЦе виглядає для вас реальним у тій локації, яку ви пригледіли?"
        }
      ]
    },
    {
      "key": "education_extended_pm",
      "title": "Навчання: Project Management з нуля",
      "conv_type": "EDUCATION",
      "messages": [
        {
          "is_user": true,
          "content": "Хочу стати Project Manager в IT. Командував взводом, тому з людьми і задачами працювати вмію. Але не знаю специфіки IT. Порадьте курси."
        },
        {
          "is_user": false,
          "content": "Вітаю! Командирський досвід — це чудова база для PM (Resource Management, Risk Management, Leadership). Але в IT своя методологія.\n\nЩоб порадити конкретне навчання, скажіть:\n1) Яка у вас англійська? (Для PM в IT часто вимагають B2+).\n2) Скільки часу готові виділяти на день?\n3) Чи цікавить сертифікат міжнародного зразка (наприклад, Google/PMI) чи краще українські курси з працевлаштуванням?"
        },
        {
          "is_user": true,
          "content": "Англійська B2, можу вільно спілкуватися. Часу маю по 3-4 години ввечері. Цікавить щось, що дасть реальні знання інструментів (Jira і т.д.), а не просто теорію. Сертифікат — плюс, але не головне."
        },
        {
          "is_user": false,
          "content": "З таким рівнем англійської та запитом на практику, пропоную комбінований підхід:\n\n**Варіант 1: Фундаментальний + Практичний (Рекомендую)**\n- **Google Project Management Certificate (Coursera).** Це база. Дає розуміння Agile, Scrum, Waterfall. Англійською. *Плюс:* Визнається у світі, безкоштовно для українців через INCO (часто бувають програми).\n- **Практика інструментів:** Самостійне вивчення Jira/Confluence (Atlassian University — є безкоштовні модулі).\n\n**Варіант 2: Інтенсивні українські курси**\n- **Mate academy / GoIT / IAMPM.** Це платні курси, але вони «ганяють» саме по практиці і готують до співбесід. Тривалість 3–5 місяців.\n\nОскільки ви хочете практику, давайте почнемо з плану самостійного опанування інструментів на цей тиждень, поки ви обираєте курс?"
        },
        {
          "is_user": true,
          "content": "Так, давайте план по інструментах. Я чув про Jira і Scrum. З чого почати?"
        },
        {
          "is_user": false,
          "content": "Ось ваш план «швидкого занурення» на 7 днів:\n\n**Дні 1-2: Методологія (Scrum Guide)**\n- Прочитати офіційний **Scrum Guide** (він короткий, є українською). Зрозуміти ролі (SM, PO, Team) та події (Daily, Sprint Review).\n- *Джерело:* scrumguides.org\n\n**Дні 3-5: Інструмент (Jira)**\n- Зареєструвати безкоштовний акаунт в **Atlassian Jira Software** (Free plan).\n- Створити свій перший проєкт (тип Scrum).\n- Створити Backlog (список задач), запустити Sprint, посувати картки по дошці (To Do -> In Progress -> Done).\n- *Джерело:* YouTube канал \"Jira for Beginners\".\n\n**Дні 6-7: Документація (Confluence)**\n- Створити сторінку проєкту в Confluence, зв'язати її з Jira.\n\nСпробуйте зареєструватися в Jira сьогодні. Якщо виникнуть питання по інтерфейсу — пишіть, підкажу."
        },
        {
          "is_user": true,
          "content": "Дякую. А наскільки складно знайти першу роботу PM-ом без досвіду саме в IT? Чи зарахують мій військовий досвід як релевантний?"
        },
        {
          "is_user": false,
          "content": "Це чесне питання. \n1. **Прямий вхід:** Без IT-досвіду одразу на PM потрапити складно, але можливо, якщо компанія працює з MilTech або ви маєте сильну англійську та софт-скіли.\n2. **Військовий досвід:** Його **обов'язково** зарахують, якщо ви правильно його опишете. Не «командував», а «керував командою, розподіляв ресурси, оцінював ризики». Рекрутери цінують стресостійкість і відповідальність ветеранів.\n\nМоя порада: шукайте позиції **Junior PM** або **Project Coordinator**. Там менші вимоги до технічних знань, але потрібна саме організація процесів, в чому ви вже профі."
        }
      ]
    },
    {
      "key": "self_employment_extended_welder",
      "title": "Самозайнятість: Вироби з металу (Loft)",
      "conv_type": "SELF_EMPLOYMENT",
      "messages": [
        {
          "is_user": true,
          "content": "Є ідея робити металеві меблі (столи, стелажі в стилі Лофт). Маю гараж, зварювальний апарат і вмію варити. Але ніколи нічого не продавав."
        },
        {
          "is_user": false,
          "content": "Чудова ніша. Лофт меблі все ще популярні, а ручна робота цінується. Оскільки технічна база у вас є, основне питання — це продажі.\n\nУточніть для старту:\n1) Чи є у вас фото хоча б 2–3 готових виробів (навіть якщо робили для себе/друзів)?\n2) Ви плануєте робити під замовлення (клієнт дає розміри) чи робити готові вироби і продавати?\n3) Скільки часу готові чекати на першого клієнта?"
        },
        {
          "is_user": true,
          "content": "Фото є, робив собі стіл і полицю. Планую під замовлення, бо не маю грошей на матеріал, щоб наробити на склад. Хочу продати щось протягом місяця."
        },
        {
          "is_user": false,
          "content": "Стратегія «під замовлення» — найбезпечніша для старту. Клієнт платить аванс (наприклад, 50-70%), ви купуєте метал/дерево.\n\nПлан виходу на ринок за 30 днів:\n\n1. **Пакування (Зараз):** Ті фото, що є — це ваше все. Якщо вони темні/в гаражі — винесіть стіл на вулицю або до світлої стіни, сфотографуйте якісно. Це впливає на ціну.\n2. **Оголошення (Тиждень 1):** OLX — ваш найкращий друг. Створіть 3-5 оголошень з різними заголовками: «Стіл Лофт», «Стіл для комп'ютера ручна робота», «Металевий стелаж під замовлення».\n3. **Соцмережі (Тиждень 2):** Instagram сторінка. Залийте туди фото, відео процесу зварювання (люди люблять дивитися, як працюють майстри).\n\nПитання по ціні: як ви плануєте рахувати вартість виробу?"
        },
        {
          "is_user": true,
          "content": "Думав порахувати матеріал і помножити на 2. Це нормально?"
        },
        {
          "is_user": false,
          "content": "Це «гаражний» метод, він простий, але небезпечний. Якщо матеріал дешевий (наприклад, труба), а роботи багато (складні шви) — ви працюватимете за копійки.\n\nРекомендую формулу:\n`Вартість = (Матеріали + Розхідники) + (Ваші години роботи * Ставка за годину) + 20% (амортизація/ризики)`\n\nНаприклад:\n- Метал+фарба+дерево = 2000 грн.\n- Роботи на 10 годин. Ваша ставка, скажімо, 150 грн/год = 1500 грн.\n- Разом = 3500 + 20% = **4200 грн.**\n\nЯкщо «матеріал х 2» дає меншу суму — ви себе недооцінюєте. Спробуйте прорахувати один свій стіл за цією формулою зараз."
        },
        {
          "is_user": true,
          "content": "Зрозумів. Виходить навіть дорожче, ніж я думав. А як щодо податків? Мені треба одразу відкривати ФОП, чи можна спробувати так?"
        },
        {
          "is_user": false,
          "content": "З точки зору закону — підприємницька діяльність має бути зареєстрована. Але з точки зору здорового глузду і реалій:\n\nПоки ви тестуєте нішу і маєте 1–2 замовлення від фізосіб (на картку або готівкою), ризики мінімальні. Багато хто починає як «хобі», щоб перевірити, чи піде справа.\n\nКоли варто відкривати ФОП (2 група): \n1. Коли піде стабільний потік грошей на картку.\n2. Якщо захочете працювати з кафе/офісами (юридичними особами) — їм потрібен рахунок і документи.\n3. Щоб спати спокійно і мати офіційний стаж.\n\nПорада: зробіть перші 3-5 продажів. Якщо побачите, що діло йде — реєструєте ФОП через Дію за 10 хвилин."
        }
      ]
    }
  ]
}